// Клас Messenger містить метод Надіслати повідомлення (отримувач, текст).
// Реалізувати непомітно для користувача підрахунок надісланих повідомлень.
// Також повідомляти поліцію, якщо повідомлення містить слово «бомба»


//Оскільки в програмі повинен бути єдиний екземпляр класу Messenger – доцільно використовувати шаблон Singleton. 
//Singleton якраз-таки дає можливість реалізувати можливість єдиний екземпляр класу. Тобто, під час роботи програми, коли клієнт
//буде намагатиметься створити новий екземпляр класу, йому повернеться один і той самий обʼєкт.   

Messenger messenger1 = Messenger.getIstance();
messenger1.SendMessage("Анастасія", "Моє серце в верховині");
System.Console.WriteLine("---------------");

Messenger messenger2 = Messenger.getIstance();
messenger2.SendMessage("Олег", "Реве та стогне Дніпр широкий");
System.Console.WriteLine("---------------");

Messenger messenger3 = Messenger.getIstance();
messenger3.SendMessage("Іван", "Це просто Бомба!");
System.Console.WriteLine("---------------");


